const questions = [
	'Что такое переменная? Через какие ключивые слова мы их задаем?',
	"Какая разница между const и let ?",
	"Какие типы данных в JS ты знаешь?",
	"Что такок Boolean?",
	"Что такое массив ? ",
	"Как мы указываем программе на то, что переменная массив?",
	"const array = [1,2,3,4,5] - как получить первый элемент в массиве?",
	"В чем разница между push() и pop()?",
	"В чем разница между shift() и unshift()?",
	'Что такое alert() ?',
	'Что такое confirm() ?',
	'Что такое prompt() ?',
	'Чем отличаються == и === ?',
	`Что такое && ? В каких случая он возращает true?`,
	'Что такое || ? В каких случая он возращает true?' ,
	`Что такое != ?`,
   `Зачем нужна конструкция
    if(...)
    {...}
    else{...}
    `,
	'Как вывести сообщение в консоль? ',
	'Что такое null и undefined ?',
	'Какие символы можно использовать при создании переменной?'

]

export default questions