
// ------------------------------- Оператори -----------

//Марк і Джон намагаються порівняти свій ІМТ (індекс маси тіла), який розраховується за формулою:
// ІМТ = маса / зріст ** 2
// ІМТ= маса / (зріст * зріст)
// 1. Збережіть масу та зріст Марка та Джона у змінних
// 2. Обчисліть ІМТ обох за допомогою формули (ви навіть можете застосувати обидві
// версії)
// 3. Створіть булеву змінну "markHigherBMI", яка містить інформацію про
// чи має Марк вищий ІМТ, ніж Джон.
// Вага Марка 78 кг, зріст 1,69 м. Джон важить 92 кг і має зріст 1,95 м.
// const markHeight = 169
//const markWeight = 78
// const johnHeight = 195
// const johnWeight = 92

// 4.
// const hasDriverLicense = true
// const hadGoodVision = true
// const isTired = true



// 5. Є дві гімнастичні команди « Dolphins» та « Koalas».
// Вони змагаються один з одним 3 рази. Переможець з найвищим середнім балом отримує трофей!
// Ваші завдання:
// 1. Обчисліть середній бал для кожної команди, використовуючи наведені нижче дані
// 2. Порівняйте середні бали команд, щоб визначити переможця змагань,
// і роздрукувати його на консолі.
// Не забувайте, що може бути нічия, тому перевірте це також (нічия означає, що вони мають однаковий середній бал)
// 3. Бонус 1: Включіть вимогу до мінімального балу 100.
// З цим правилом команда перемагає лише в тому випадку, якщо вона має вищий бал, ніж інша команда,
// і в той же час набравши не менше 100 очок.
// Підказка: використовуйте логічний оператор, щоб перевірити мінімальний бал, а також кілька блоків else-if 😉
// 4. Бонус2: мінімальні результати, які можна застосувати до нічиєї!
// Випадок відбувається лише тоді, коли обидві команди мають однаковий рахунок і обидві мають більше або рівні 100 очок.
// Інакше жодна команда не виграє трофей
//
// Дані:
// § Дані 1: дельфіни 96, 108 і 89. Коали 88, 91 і 110
// § Бонус даних 1: Дельфіни оцінюють 97, 112 і 101. Коали 109, 95 і 123


// -------------- Switch


/// const day = 'monday'
//
// switch(day){
// 	case 'monday': // day === 'monday'
// 		console.log('MONNNDAAAYY')
// 		console.log('I hate mondays!!!')
// 		break;
// 	case 'tuesday':
// 		console.log('Oh, i need to go to work again')
// 		break;
// 	case 'wednesday':
// 	case 'thursday':
// 		console.log('Write code all day')
// 		break;
// 	case 'friday':
// 		console.log('FINALLY i can play video games')
// 		break
// 	case 'saturday':
// 	case 'sunday':
// 		console.log('Sleeping all day ')
// 		break;
// 	default:
// 		console.log('Not a valid day')
// }

// -------------- For

// for(let i = 0 ; i < 10 ; i ++){
// 	console.log(`Lifting weights repetition ${i}`)
// }



  // -------------- For array's

// const arr = [true, 1 ,'str', undefined];
//
// let a = [];
//
// for(let i = 0; i<= arr.length ; i++){
// 	a[i] = typeof arr[i]
// }
// console.log(a)


// -------------- For continue & break

// const arr = [true, 1 ,'str'];
//
// let a = [];
//
// for(let i = 0; i< arr.length ; i++){
// 	if(typeof arr[i] !== 'string') continue
// 	a[i] = typeof arr[i]
// }
// console.log(a)

// -------------- For array's backwards


// const arr = [true, 1 ,'str'];
//
// let a = [];
//
// for(let i = arr.length - 1; i >= 0 ; i--){
// 	console.log(arr[i])
// }

// ------- Loop in a Loop

// for(let i = 1 ; i <4 ; i ++){
// 	console.log(`--------${i} exercise`)
// 	for(let rep = 1 ; rep < 6 ; rep ++){
// 		console.log(`--------${rep} repetition`)
// 	}
// }



////

// Стівен хоче створити дуже простий калькулятор чайових для кожного разу, коли він їде в ресторан.
// 	У його країні зазвичай дають чайові 15%, якщо вартість банкноти становить від 50 до 300.
// Якщо вартість відрізняється, чайові становлять 20%.
// Ваші завдання:
// 	1. Обчисліть чайові залежно від вартості рахунку. Створіть для цього змінну, яка називається "tip".
// 	Не дозволяється використовувати оператор if/else 😅 (Якщо вам простіше, ви можете почати з оператора if/else, а потім спробуйте перетворити його на потрійний оператор!)
// 2. Роздрукуйте ланцюжок на консолі, що містить вартість рахунку, чайові та кінцеву вартість (рахунка + чайові).
// 	Приклад: «Рахунок становив 275, чайові були 41,25, а загальна вартість 316,25»
//
// Дані тесту:
// 	§ Дані 1: Перевірка вартості рахунків 275, 40 і 430
//
// Підказки:
// § Щоб обчислити 20% значення, просто помножте його на 20/100 = 0,2
// § Значення X знаходиться між 50 і 300, якщо воно>= 50 && <= 300😉


// const bill =275
// const tip = bill > 50 && bill < 300 ? 15 : 20
//
// console.log(`The bill if ${bill}$ , and the tip is ${tip}%. Total amount ${(bill * tip / 100) + bill}`)


// --------- While

// let rep = 1
// while(rep <=10){
// 	console.log(rep)
// 	rep++
// }

// let dice = Math.ceil(Math.random()*6) // trunc , floor + 1
//
// while(dice !== 6) {
// 	console.log(dice)
// 	dice = Math.ceil(Math.random() * 6)
// 	if (dice === 6) {
// 		console.log('end')
// 	}
// }

// let a =1
//
// console.log(++a)

// for(let a = 1 ; a<= 20 ; a++){
// 	if(a % 2 == 0){
// 		console.log(a)
// 	}
// }
// for(let a = 1 ; a<= 20 ; a++){
// 	if(a % 2 != 0){
// 		console.log(a)
// 	}
// }

// let a = 0
// for(let i = 5; i<=50 ; i++  ){
// 	a= a + i // a+=i
// }
// console.log(a)

// let a = 0
// for(let i = 5 ; i < 30 ; i++){
// 	if( i%7 == 0){
// 		a+=i
// 	}
// }
// console.log(a)